tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f0;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.1 -2.1 -0.1)(0.201 2.51 0.01);
    }

    {
        name    coupledWall;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   coupledWallTmp;
    }

    {
        name    coupledWall;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        faceSet coupledWall;
    }
);


// ************************************************************************* //
